#-1
[net]
saturation=1.5
policy=steps
momentum=0.9
batch=64
exposure=1.5
burn_in=1000
learning_rate=0.0003
scales=.1,.1
angle=5
width=416
height=416
max_batches=500200
steps=400000,450000
hue=.1
channels=3
decay=0.0005
subdivisions=4


#0
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=13
batch_normalize=1


#1
[maxpool]
size=2
stride=2


#2
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=26
batch_normalize=1


#3
[maxpool]
size=2
stride=2


#4
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=51
batch_normalize=1


#5
[maxpool]
size=2
stride=2


#6
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=102
batch_normalize=1


#7
[maxpool]
size=2
stride=2


#8
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=205
batch_normalize=1


#9
[maxpool]
size=2
stride=2


#10
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=410
batch_normalize=1


#11
[maxpool]
size=2
stride=1


#12
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=819
batch_normalize=1


#13
[convolutional]
stride=1
activation=leaky
size=1
pad=1
filters=205
batch_normalize=1


#14
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=410
batch_normalize=1


#15
[convolutional]
stride=1
activation=linear
size=1
pad=1
filters=75


#16
[yolo]
classes=20
anchors=43,65, 99,148, 117,261, 291,192, 204,349, 364,358
truth_thresh=1
num=6
mask=3,4,5
jitter=.3
ignore_thresh=.5
random=1


#17
[route]
layers=-4


#18
[convolutional]
stride=1
activation=leaky
size=1
pad=1
filters=102
batch_normalize=1


#19
[upsample]
stride=2


#20
[route]
layers=-1, 8


#21
[convolutional]
stride=1
activation=leaky
size=3
pad=1
filters=205
batch_normalize=1


#22
[convolutional]
stride=1
activation=linear
size=1
pad=1
filters=75


#23
[yolo]
classes=20
anchors=43,65, 99,148, 117,261, 291,192, 204,349, 364,358
truth_thresh=1
num=6
mask=0,1,2
jitter=.3
ignore_thresh=.5
random=1


